tutorials/heatTransfer/buoyantSimpleSolver/buoyantCavity/0/U
/*---------------------------------------------------------------------------*
Caelus 10.04
Web:   www.caelus-cml.com
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    frontAndBack
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }

    topAndBottom
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }

    hot
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }

    cold
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
}


// ************************************************************************* //
