tutorials/heatTransfer/buoyantSimpleSolver/buoyantCavity/0/k
/*---------------------------------------------------------------------------*
Caelus 10.04
Web:   www.caelus-cml.com
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 3.75e-04;

boundaryField
{
    frontAndBack
    {
        type            kqRWallFunction;
        value           uniform 3.75e-04;
    }
    topAndBottom
    {
        type            kqRWallFunction;
        value           uniform 3.75e-04;
    }
    hot
    {
        type            kqRWallFunction;
        value           uniform 3.75e-04;
    }
    cold
    {
        type            kqRWallFunction;
        value           uniform 3.75e-04;
    }
}


// ************************************************************************* //
