tutorials/heatTransfer/buoyantSimpleSolver/buoyantCavity/0/p_rgh
/*---------------------------------------------------------------------------*
Caelus 10.04
Web:   www.caelus-cml.com
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      p_rgh;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 1e5;

boundaryField
{
    frontAndBack
    {
        type            fixedFluxPressure;
        value           uniform 1e5;
    }

    topAndBottom
    {
        type            fixedFluxPressure;
        value           uniform 1e5;
    }

    hot
    {
        type            fixedFluxPressure;
        value           uniform 1e5;
    }

    cold
    {
        type            fixedFluxPressure;
        value           uniform 1e5;
    }
}


// ************************************************************************* //
