tutorials/heatTransfer/buoyantSimpleSolver/buoyantCavity/system/sampleDict
/*---------------------------------------------------------------------------*
Caelus 10.04
Web:   www.caelus-cml.com
\*---------------------------------------------------------------------------*/
FoamFile
{
    version         2.0;
    format          ascii;
    class           dictionary;
    location        "system";
    object          sampleDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
type sets;

libs ("libsampling.so");
    
interpolationScheme cellPointFace;

setFormat raw;

sets
(
    y0.1
    {
        type            face;
        axis            x;
        start           (-1 0.218 0);
        end             (1 0.218 0);
    }
    y0.2
    {
        type            face;
        axis            x;
        start           (-1 0.436 0);
        end             (1 0.436 0);
    }
    y0.3
    {
        type            face;
        axis            x;
        start           (-1 0.654 0);
        end             (1 0.654 0);
    }
    y0.4
    {
        type            face;
        axis            x;
        start           (-1 0.872 0);
        end             (1 0.872 0);
    }
    y0.5
    {
        type            face;
        axis            x;
        start           (-1 1.09 0);
        end             (1 1.09 0);
    }
    y0.6
    {
        type            face;
        axis            x;
        start           (-1 1.308 0);
        end             (1 1.308 0);
    }
    y0.7
    {
        type            face;
        axis            x;
        start           (-1 1.526 0);
        end             (1 1.526 0);
    }
    y0.8
    {
        type            face;
        axis            x;
        start           (-1 1.744 0);
        end             (1 1.744 0);
    }
    y0.9
    {
        type            face;
        axis            x;
        start           (-1 1.962 0);
        end             (1 1.962 0);
    }
);

fields
(
    T
    U
);


// ************************************************************************* //
